makeup-api/app/controllers/products_controller.rb

INSERT INTO "products" ("name", "brand", "price", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Blush"], ["brand", "Chanel"], ["price", 22], ["category", "Makeup"], ["created_at", "2020-01-16 20:32:48.724555"], ["updated_at", "2020-01-16 20:32:48.724555"]]
---
  def create
    @product = Product.new(product_params)
    @product.save

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "name" = ?, "brand" = ?, "price" = ?, "category" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "i dont like you"], ["brand", "meh"], ["price", 11], ["category", "makeuo"], ["updated_at", "2020-03-04 19:21:02.062610"], ["id", 1]]
---
  def update
    @product = Product.find_by(id: params[:id])
    @product.update(product_params)