makeup-api/app/controllers/reviews_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("title", "content", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Really Amazing!"], ["content", "    This eyeshadow is really great! "], ["rating", "5"], ["created_at", "2020-03-09 23:22:44.373552"], ["updated_at", "2020-03-09 23:22:44.373552"]]
---
  def create
    @product = Product.find_by(id: params[:product_id])

    @review = Review.new(review_params)
    @review.save

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "reviews" SET "title" = ?, "content" = ?, "rating" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["title", "Much"], ["content", "ok very nice"], ["rating", "10"], ["updated_at", "2020-03-09 01:21:15.908498"], ["id", 1]]
---
  def update
    @review = Review.find_by(id: params[:id])

    @review.update(review_params)